### Terraform Plan Output:

```
data.aws_caller_identity.current: Reading...
aws_key_pair.airflow_key_w: Refreshing state... [id=airflow-key-no-pass]
aws_s3_object.marketing_data_simulation: Refreshing state... [id=scripts/python_shell/sample-meta-gen.py]
aws_vpc.airflow_vpc: Refreshing state... [id=vpc-057ca11e482b7e437]
aws_s3_object.data_consumption_social_media_meta_script: Refreshing state... [id=scripts/glue/data-consumption-meta-month.py]
aws_iam_role.glue_role: Refreshing state... [id=glue-role-prod]
aws_s3_object.data_transformation_social_media_script: Refreshing state... [id=scripts/glue/data-transformation-social-media.py]
aws_iam_policy.glue_s3_prefix_policy: Refreshing state... [id=arn:aws:iam::654654560187:policy/glue-s3-prefix-policy]
aws_iam_role.airflow_role: Refreshing state... [id=airflow-ec2-role]
data.aws_caller_identity.current: Read complete after 0s [id=654654560187]
aws_iam_policy.airflow_dag_extended_permissions: Refreshing state... [id=arn:aws:iam::654654560187:policy/AirflowDagCommonActions]
aws_iam_role_policy_attachment.athena_full_access: Refreshing state... [id=glue-role-prod-20250510062649979700000003]
aws_iam_role_policy_attachment.glue_custom_s3_access: Refreshing state... [id=glue-role-prod-20250510062649851000000001]
aws_glue_job.data_consumption_social_media_meta: Refreshing state... [id=data-consumption-social-media-meta]
aws_iam_role_policy_attachment.glue_console_access: Refreshing state... [id=glue-role-prod-20250510062649864900000002]
aws_iam_role_policy_attachment.glue_service_role: Refreshing state... [id=glue-role-prod-20250510062649993400000004]
aws_glue_job.simulate_marketing_data: Refreshing state... [id=sdata-ingestion-social-media]
aws_glue_job.data_transformation_social_media: Refreshing state... [id=data-transformation-social-media]
aws_iam_role_policy_attachment.airflow_extended: Refreshing state... [id=airflow-ec2-role-20250510210855281700000001]
aws_iam_instance_profile.airflow_instance_profile: Refreshing state... [id=airflow-ec2-profile]
aws_iam_role_policy.ssm_read_airflow_admin: Refreshing state... [id=airflow-ec2-role:AirflowSSMReadAccess]
aws_subnet.public_subnet_2: Refreshing state... [id=subnet-0abe80bc28cef751c]
aws_internet_gateway.igw: Refreshing state... [id=igw-0314a72b56c20dc6a]
aws_route_table.public_rt: Refreshing state... [id=rtb-05aee19d22469812b]
aws_subnet.public_subnet_1: Refreshing state... [id=subnet-05f98da85570d76ef]
aws_security_group.airflow_sg: Refreshing state... [id=sg-01b4eff178d7125ad]
aws_route_table_association.public_rt_assoc: Refreshing state... [id=rtbassoc-0e4e8f201a25e43ae]
aws_db_subnet_group.airflow_subnets: Refreshing state... [id=airflow-subnet-group]
aws_route.default_route: Refreshing state... [id=r-rtb-05aee19d22469812b1080289494]
aws_instance.airflow_scheduler: Refreshing state... [id=i-05f0dbad7c5c7a4fa]
aws_instance.airflow: Refreshing state... [id=i-02a48fd9f8b0a49eb]
aws_db_instance.airflow_rds: Refreshing state... [id=db-2BNO3QWCLIJVK2DCWBZQKMCIAY]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.airflow must be replaced
-/+ resource "aws_instance" "airflow" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:654654560187:instance/i-02a48fd9f8b0a49eb" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-02a48fd9f8b0a49eb" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0dde1dae082d2f7a2" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-178.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.178" -> (known after apply)
      ~ public_dns                           = "ec2-52-70-21-53.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.70.21.53" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-01b4eff178d7125ad",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "airflow-webserver"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-01b4eff178d7125ad",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0d5cb94b41fe015d5" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_instance.airflow_scheduler must be replaced
-/+ resource "aws_instance" "airflow_scheduler" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:654654560187:instance/i-05f0dbad7c5c7a4fa" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-05f0dbad7c5c7a4fa" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0738268e96d11dbc2" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-208.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.208" -> (known after apply)
      ~ public_dns                           = "ec2-3-92-206-193.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.92.206.193" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-01b4eff178d7125ad",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "airflow-scheduler"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-01b4eff178d7125ad",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0983cd728ebed97c9" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ ec2_public_ip       = "52.70.21.53" -> (known after apply)
  ~ scheduler_public_ip = "3.92.206.193" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```